'''
程序的流程控制使用if语句
'''

'''
关系运算符
python中所使用的关系运算符如下：
关系运算符           说明          实例            说明
>                  大于          a>b             检查是否a大于b
>=               大于或等于       a>=b            检查是否a大于或等于b
<                   小于         a<b             检查是否a小于b
<=               小于或等于       a<=b            检查是否a小于或等于b
==                  等于         a==b            检查是否a等于b
!=                  不等于       a!=b             检查是否a不等于b
上述运算如果是真则返回true，如果是假则返回false
逻辑运算符：
and   必须两个或多个条件全部正确才会返回true 
or    两个或多个中的某一个条件正确即可返回true
not   如果是true，经过not运算会返回false；如果是false，经过not运算会返回true
'''



'''
if语句
if语句的基本语法如下：
if （条件判断）       条件判断外的小括号可有可无

程序代码块：
上述语句如果条件判断是Ture,则执行程序代码段；如果条件判断是False，则不执行程序代码快

'''